* Tasks
** TODO java learning,you should take care the XML                              :javaxml:

Added: [2015-05-03 Sun 19:04]
** TODO finish a learning report about the java                                 :javaxml:
   - 
Added: [2015-05-03 Sun 19:17]
** DOING TestTodo                                                      :@Test:
- State "DOING"      from "TODO"         [2017-10-08 周日 03:19]
*** CANCELED [#A] little [100%]                                           :funnny:
CLOSED: [2017-10-08 周日 03:18]
- State "CANCELED"   from "DOING"         [2017-10-08 周日 03:18]
- State "DOING"      from "DONE"          [2017-10-08 周日 03:18]
- State "DONE"       from "TODO"         [2017-10-08 周日 03:18]
- State "TODO"       from "DONE"       [2017-09-27 周三 16:51]
- State "DONE"       from "TODO"       [2017-09-27 周三 16:51]
 - [X] first
 - [X] second
 - [X] last
 - :q

Added: [2015-05-03 Sun 21:38]
*** TODOS PhaseVi mesh manufactory                                  :@work:
1. do for the nacelle yaw
Added: [2017-09-18 周一 11:07]
** BUG TODOS Combine Plan into org-mode                           :Plan:mode:



   - State "BUG"        from              [2017-09-05 周二 16:48]
   Addd: [2015-05-04 Mon 02:37]
** DONE TODOS setting CFD calculation                                :@work:
CLOSED: [2017-09-29 周五 23:41] SCHEDULED: <2017-09-13 周三>
 
- State "DONE"       from              [2017-09-29 周五 23:41]
 Added: [2017-09-13 周三 01:22]
*dfdf* 
 /slash/
** TODOS read the elisp code                                         :@F708:

Jumping to code

(define-key emacs-lisp-mode-map (kbd "C-c .") 'find-function-at-point)
(bind-key "C-c f" 'find-function)


Added: [2017-09-27 周三 17:50]
** PENDING STARTED drink tea
SCHEDULED: <2017-09-29 周五 +1d> DEADLINE: <2017-09-27 周三>
:PROPERTIES:
:LAST_REPEAT: [2017-09-28 周四 15:16]
:END:
- State "DONE"       from "TODO"       [2017-09-28 周四 15:16]
- State "TODO"       from              [2017-09-28 周四 14:34]
:PROPERties:
:EFFORT: 0:30
:END:
:LOGBOOK:
CLOCK: [2017-09-27 周三 22:34]--[2017-09-27 周三 22:44] =>  0:10
:END:
** TODO find the army software
:PROPERTIES:
:Effort: 0:15
:END:
Captured 2017-09-27 22:52
** TODO GetThingsDone
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    Captured 2017-09-28 11:21
*** 1. you capture the ideas or todos
**** 2. you capture your todos with time, so you have time pocket(momentum); However
**** 2.5 however, you will be overwhelmed by tasks, so you can also group tasks into projects or context.(group tasks into project)
**** 3. List your todos or tasks with routines and checklists, so you can do things consistently even if fuzzy brains
***** 4. you need to schedule the most important thing to be done , so you don't take off the ball and focus a little things(You dont'
worry about missing deadline.(scheduled tasks will be informed of you)
****** 5. but still too much. So be realistics and add priviledge to your schedule tasks, eliminate some not so important not so hurry
*** 6. finally you track all you task (so you know what the time went by)
*** 7. also you do some overview the process (so you do appreciate how things adds up)
** DONE [#A] new mesh for the double-sliding mesh :@work::multiAxis:紧急重要:
CLOSED: [2017-09-29 周五 23:40] SCHEDULED: <2017-09-28 周四>
                    :PROPERTIES:
                    :Effort: 1:00
                    :END:
                    - State "DONE"       from "TODO"       [2017-09-29 周五 23:40]
                    Captured 2017-09-28 13:52
** TODO [#B] Read papers related to yaw preparing for the thesis proposal :@work::graduation:紧急重要:
SCHEDULED: <2017-09-29 周五 . +1w>

- State "TODO"       from "TODO"          [2017-10-08 周日 02:33]
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    Captured 2017-09-28 13:58
** DONE [#B] change the list style in org-mode                    :PERSONAL:
CLOSED: [2017-09-29 周五 09:45] DEADLINE: <2017-09-28 周四>
                    :PROPERTIES:
                    :Effort: 0:15
                    :END:
                    - State "DONE"       from "TODO"       [2017-09-29 周五 09:45]
                    Captured 2017-09-28 14:07
                Doesn't work!                   
** TODO [#B] First Report for your graduation                        :@work:
DEADLINE: <2017-10-23 周一> SCHEDULED: <2017-10-02 周一>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    Captured 2017-10-02 11:05
** TODO [#A] 开题报告+文献综述+中央高校基金                         :@work:
DEADLINE: <2017-10-22 周日> SCHEDULED: <2017-10-03 周二>
                    :PROPERTIES:
                    :Effort: 4:00
                    :END:
                    Captured 2017-10-03 14:15
       开题报告得包含以下几个部分，
***** TODO 数值模拟 静态偏航+动态偏航+ 流固耦合(参考仇永兴 姚世刚 陈晓明 范钟瑶 李媛 任会来) [0%]
- State "TODO"       from "TODO"       [2017-10-03 周二 14:25]
- State "TODO"       from "ABORT"      [2017-10-03 周二 14:25] [ ] 
- [-] 任务分解 [20%]
  1. [ ] 背景介绍
     1. [ ]《风电13五规划》
     2. [ ]《2006-2016风电装机容量发展》
     3. [ ]《2016年度全球风电报告》 4%占全球总发电量
     4. [ ] 气弹非稳定性
  2. [X] 静态偏航
  3. [-] 动态偏航
     1. [X] 动态入流角
        在cfx的结果，暂时以失败告终。
     2. [ ] 机舱偏航
  4. [-] 流固耦合(参考姚世刚 李媛 李新凯 陈晓明)
     1. [X] 单向
     2. [ ] 双向
  5. [ ] FVM 自由涡尾迹(参考仇永兴)
***** TODO 实验部分 NREL5MW的数值模拟(参考赵宗德 周广鑫 李新凯) [0%]
- State "TODO"       from              [2017-10-03 周二 14:25]
- [ ] 任务分解
  - [ ] NREL5MW的实验研究
    - [ ] 叶片介绍
    - [ ] 轮毂+塔架介绍
    - [ ] 控制系统介绍
    - [ ] 实验方案介绍
      - [ ] 偏航实验
      - [ ] 前后四周晃动实验
  - [ ] 丝线实验 流场可视化实验

* Tasks
** TODO Most important thing that you have to do       :graduation:紧急重要:
** TODO Second most important thing that you have to do
You can also take notes underneath each heading, like this
** TODO 花销(expense)

That's your gtd

| Date              | Category |  Money | People |
|-------------------+----------+--------+--------|
| <2017-10-07 周六> | Book     |   30.6 |        |
| <2017-10-09 周一> | Film     |   70.6 |        |
| <2017-11-10 周五> | Bus      |   50.2 |        |
| <2017-11-11 周六> | Bus      |   60.2 | xinran |
| <2017-11-12 周日> | Eating   |   1000 | Ye     |
|-------------------+----------+--------+--------|
|                   | Total:   | 1211.6 |        |
#+TBLFM: @>$3=vsum(@2..@-1)   


#+BEGIN_EXAMPLE
@> The @ specifies a row, and this refers to the last row in a table.
    $3 The $ specifies a column, so this refers to the third column.
    vsum A vertical sum function with parameters given in parenthesis
    @2 The second row. Notice that it the Amount header is @1 and the dashes separating the header from the body is ignored.
    @-1 The next to the last row. Using these relative references mean that we can add rows to our table, and still have the sum formula work.


http://www.howardism.org/Technical/Emacs/spreadsheet.html
#+END_EXAMPLE


